ucm_internship_core/app/Models/Master/StudentModel.php

    protected function syncStatusAfterFind(array $data)
    {
        if (!isset($data['data'])) return $data;

        $idsToDeactivate = [];

        $process = function ($row) use (&$idsToDeactivate) {
            if (is_object($row) && isset($row->is_active) && $row->is_active == '1') {
                $db = \Config\Database::connect();

                $internship = $db
                    ->table('ictadmin_dbwp_ucm_internship.m_internship_student ms')
                    ->join(
                        'ictadmin_dbwp_ucm_internship.m_internship m',
                        'm.id = ms.internship_id'
                    )
                    ->where('ms.student_id', $row->id)
                    ->where('m.is_active', 0)
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `ictadmin_dbwp_ucm_internship`.`m_internship_student` `ms`
JOIN `ictadmin_dbwp_ucm_internship`.`m_internship` `m` ON `m`.`id` = `ms`.`internship_id`
WHERE `ms`.`student_id` = '019d7739-4896-70ff-be8c-12b4eb8f8427'
AND `m`.`is_active` = 0

        }

        if (!empty($idsToDeactivate)) {
            \Config\Database::connect()
                ->table($this->table)
                ->whereIn('id', $idsToDeactivate)
                ->update(['is_active' => 0]);
---
UPDATE `ictadmin_dbwp_ucm_master`.`m_student` SET `is_active` = 0
WHERE `id` IN ('019d7739-4896-70ff-be8c-12b4eb8f8427')