app/Entities/Session.php

SELECT *
FROM `admins`
WHERE `user_id` = '271ee3da-1309-11f1-8722-94659c524356'
AND `admins`.`deleted_at` IS NULL
 LIMIT 1
---
    public function getAdmin()
    {
        $adminModel = new AdminModel();
        return $adminModel->where('user_id', $this->attributes['user_id'])->first();