ucm_internship_core/app/Entities/Internship/InternshipStudentEntity.php

SELECT *
FROM `ictadmin_dbwp_ucm_internship`.`m_internship`
WHERE `id` = '019d7738-9cb4-713a-9b6c-257831b064ac'
---
    public function getInternship()
    {
        return $this->internshipModel
            ->where('id', $this->attributes['internship_id'])
            ->get()
            ->getFirstRow(InternshipEntity::class);

SELECT *
FROM `db_mstr`.`m_student`
WHERE `id` = '019d6267-3c2a-71f0-bcd8-f374cfab6621'
---
    public function getStudent()
    {
        return $this->studentModel
            ->where('id', $this->attributes['student_id'])
            ->get()
            ->getFirstRow(StudentEntity::class);

SELECT *
FROM `ictadmin_dbwp_ucm_internship`.`t_internship_attendance`
WHERE `internship_student_id` = '019d7739-4899-726b-b81c-61d55b337c83'
ORDER BY `created_date` DESC
---
    public function getLastAttendance()
    {
        $attendances = $this->internshipAttendanceModel
            ->where('internship_student_id', $this->attributes['id'])
            ->orderBy('created_date', 'DESC')
            ->get()
            ->getResult(InternshipAttendanceEntity::class);