ucm_internship_core/app/Entities/Internship/InternshipEntity.php

SELECT *
FROM `ictadmin_dbwp_ucm_internship`.`m_internship_student`
WHERE `internship_id` = '019d7738-9cb4-713a-9b6c-257831b064ac'
---
    public function getStudentInternships()
    {
        return $this->internshipStudentModel
            ->where('internship_id', $this->attributes['id'])
            ->get()
            ->getResult(InternshipStudentEntity::class);