ucm_internship_core/app/Filters/AuthFilter.php

SELECT *
FROM `ictadmin_dbwp_ucm_master`.`m_session`
WHERE `id` = '019df563-4dd3-70ac-8b67-e83da45d2f8e'
 LIMIT 1
UPDATE `ictadmin_dbwp_ucm_master`.`m_session` SET `last_access` = '2026-05-05 08:49:35'
WHERE `ictadmin_dbwp_ucm_master`.`m_session`.`id` IN ('019df563-4dd3-70ac-8b67-e83da45d2f8e')
---
    public function before(RequestInterface $request, $arguments = null)
    {
        $token = $_COOKIE['token'] ?? $request->getHeaderLine('token') ?? null;
        $sessionModel = new SessionModel();

        // Cek apakah token ada di database
        $session = $token ? $sessionModel->where('id', $token)->first() : null;

        if (!$session) {
            return redirect()->to(base_url('/auth/login'));
        } else {
            $sessionModel->update($session->id, ['last_access' => date('Y-m-d H:i:s')]);