ucm_internship_core/app/Controllers/InternshipController.php

    public function getInternships($id = null)
    {
        $internships = [];
        $token = $this->request->getHeaderLine('token');
        $user = $this->sessionModel->where('id', $token)->first()->getUser();
---
SELECT *
FROM `ictadmin_dbwp_ucm_master`.`m_session`
WHERE `id` = '019f7d33-1edc-71c1-9370-002e5c2a6a80'
 LIMIT 1

            }
        } else {
            if ($user->is_super_admin == 1) {
                $queryRes = $this->internshipModel->findAll();
---
SELECT *
FROM `ictadmin_dbwp_ucm_internship`.`m_internship`

    public function getDepartments()
    {
        $departments = [];
        $token = $this->request->getHeaderLine('token');
        $user = $this->sessionModel->where('id', $token)->first()->getUser();

        if ($user->is_super_admin == 1) {
            $queryRes = $this->internshipModel->select('department')->groupBy('department')->findAll();
---
SELECT *
FROM `ictadmin_dbwp_ucm_master`.`m_session`
WHERE `id` = '019f7d33-1edc-71c1-9370-002e5c2a6a80'
 LIMIT 1
SELECT `department`
FROM `ictadmin_dbwp_ucm_internship`.`m_internship`
GROUP BY `department`