ucm_internship_core/app/Controllers/StudentController.php

    public function getStudents($id = null)
    {
        $students = [];
        $token = $this->request->getHeaderLine('token');
        $user = $this->sessionModel->where('id', $token)->first()->getUser();
---
SELECT *
FROM `ictadmin_dbwp_ucm_master`.`m_session`
WHERE `id` = '019df563-4dd3-70ac-8b67-e83da45d2f8e'
 LIMIT 1

            }
        } else {
            if ($user->is_super_admin == 1) {
                $queryRes = $this->studentModel->findAll();
---
SELECT *
FROM `ictadmin_dbwp_ucm_master`.`m_student`

    public function setIsActive($id, $isActive)
    {
        $token = $this->request->getHeaderLine('token');
        $user = $this->sessionModel->where('id', $token)->first()->getUser();
        $userId = $user->id;

        $student = [
            'is_active' => $isActive,
            'modified_by' => $userId,
        ];

        $studentData = $this->studentModel->find($id);
        if ($studentData) {
            $studentSameData = $this->studentModel
                ->where('nim', $studentData->nim)
                ->where('full_name', $studentData->full_name)
                ->where('major', $studentData->major)
                ->where('sub_major', $studentData->sub_major)
                ->where('id !=', $studentData->id)
                ->where('is_active', 1)
                ->findAll();
            if (count($studentSameData) == 0) {
                if ($user->is_super_admin || $studentData->created_by == $userId) {
                    $internshipData = $this->internshipModel->where('id', $studentData->getInternshipStudent()->internship_id)->where('is_active', 1)->first();
                    if ($internshipData || $isActive == 0) {
                        if ($this->studentModel->update($id, $student)) {
---
SELECT *
FROM `ictadmin_dbwp_ucm_master`.`m_session`
WHERE `id` = '019df563-4dd3-70ac-8b67-e83da45d2f8e'
 LIMIT 1
SELECT *
FROM `ictadmin_dbwp_ucm_master`.`m_student`
WHERE `ictadmin_dbwp_ucm_master`.`m_student`.`id` = '019d7739-4896-70ff-be8c-12b4eb8f8427'
SELECT *
FROM `ictadmin_dbwp_ucm_master`.`m_student`
WHERE `nim` = '0806022310001'
AND `full_name` = 'Gilbert De Foucauld Winardy'
AND `major` = 'Informatics'
AND `sub_major` = 'Full Stack Development'
AND `id` != '019d7739-4896-70ff-be8c-12b4eb8f8427'
AND `is_active` = 1
SELECT *
FROM `ictadmin_dbwp_ucm_internship`.`m_internship`
WHERE `id` = '019d7738-9cb4-713a-9b6c-257831b064ac'
AND `is_active` = 1
 LIMIT 1
UPDATE `ictadmin_dbwp_ucm_master`.`m_student` SET `is_active` = '1', `modified_by` = 'eef31c70-34d2-11f1-8764-94659c524356'
WHERE `ictadmin_dbwp_ucm_master`.`m_student`.`id` IN ('019d7739-4896-70ff-be8c-12b4eb8f8427')