ucm_internship_core/app/Models/Internship/InternshipModel.php

UPDATE `ictadmin_dbwp_ucm_internship`.`m_internship` SET `is_active` = 0
WHERE `id` IN ('019d7738-9cb4-713a-9b6c-257831b064ac')
---
    protected function syncStatusAfterFind(array $data)
    {
        if (!isset($data['data'])) return $data;

        $idsToUpdate = [];
        $today = date('Y-m-d');

        $process = function ($row) use (&$idsToUpdate, $today) {
            if (is_object($row) && isset($row->end_date) && $row->end_date < $today && $row->is_active == '1') {
                $row->is_active = '0';
                $idsToUpdate[] = $row->id;
            }
            return $row;
        };

        if (!is_array($data['data'])) {
            $data['data'] = $process($data['data']);
        } else {
            foreach ($data['data'] as $key => $row) {
                $data['data'][$key] = $process($row);
            }
        }

        if (!empty($idsToUpdate)) {
            // ✅ Bypass model callbacks dengan db->table() langsung
            \Config\Database::connect()
                ->table($this->table)
                ->whereIn('id', $idsToUpdate)
                ->update(['is_active' => 0]);