ucm_internship_core/app/Entities/Master/SessionEntity.php

SELECT *
FROM `ictadmin_dbwp_ucm_master`.`m_user`
WHERE `ictadmin_dbwp_ucm_master`.`m_user`.`id` = 'eef31c70-34d2-11f1-8764-94659c524356'
---
    public function getUser()
    {
        return $this->userModel->find($this->attributes['user_id']);