ucm_internship_core/app/Entities/Master/StudentEntity.php

    public function getInternshipStudent()
    {
        return $this->internshipStudentModel
            ->where('student_id', $this->attributes['id'])
            ->get()
            ->getFirstRow(InternshipStudentEntity::class);
---
SELECT *
FROM `ictadmin_dbwp_ucm_internship`.`m_internship_student`
WHERE `student_id` = '019d7739-4896-70ff-be8c-12b4eb8f8427'