app/Controllers/AttendanceController.php

    public function createAttendance()
    {
        $data = $this->request->getJSON(true);
        $rawInput = $data['input'];
        $nim = explode('+', $rawInput)[0];
        $student = $this->studentModel->where("NIM", $nim)->where('is_active', 1)->first();
---
SELECT *
FROM `ictadmin_dbwp_ucm_master`.`m_student`
WHERE `NIM` = '0806022310001'
AND `is_active` = 1
 LIMIT 1

    public function viewTodayAttendances()
    {
        $queryRes = $this->internshipAttendanceModel->where('scan_time', date('Y-m-d'))->findAll();
---
SELECT *
FROM `ictadmin_dbwp_ucm_internship`.`t_internship_attendance`
WHERE `scan_time` = '2026-04-21'