app/Controllers/AuthController.php

    public function getUserByToken()
    {
        $token = $this->request->getHeaderLine('token');;
        $sessionModel = new SessionModel();
        $session = $sessionModel->where('id', $token)->first();
---
SELECT *
FROM `ictadmin_dbwp_ucm_master`.`m_session`
WHERE `id` = '019d7738-2b28-73ba-bd2e-a688d7a6c68e'
 LIMIT 1