app/Entities/Internship/InternshipAttendanceEntity.php

SELECT *
FROM `db_internship`.`m_internship_student`
WHERE `id` = '019d6267-3c3c-71fb-8943-d8b03401f96d'
---
    public function getInternshipStudent()
    {
        return $this->internshipStudentModel
            ->where('id', $this->attributes['internship_student_id'])
            ->get()
            ->getFirstRow(InternshipStudentEntity::class);